Repository: Food-Busters/food_busters
Catalog: lib/l10n/app_*.arb
Languages: th

source: Hello World!
th: สวัสดีชาวโลก!

source: Username
th: ชื่อผู้ใช้

source: Email
th: อีเมล

source: Password
th: รหัสผ่าน

# username_fail
source: Please Input Username
th: โปรดใส่ชื่อผู้ใช้

# email_null
source: Please Input Email
th: โปรดใส่อีเมล

# email_invalid
source: Invalid Email
th: รูปแบบอีเมลไม่ถูกต้อง

# password_fail
source: Please Input Password
th: โปรดใส่รหัสผ่าน

source: Forget Password?
th: ลืมรหัสผ่าน?

source: Create New Account
th: สร้างบัญชีใหม่

source: Login
th: เข้าสู่ระบบ

source: REGISTER
th: ลงทะเบียน

source: Home
th: หน้าหลัก

source: GREETINGS
th: สวัสดี

source: Have a nice Meal!
th: ทานอาหารให้อร่อยนะ!

source: SCAN
th: สแกน

source: MY POINTS
th: แต้มของฉัน

source: MY RECORD
th: บันทึกของฉัน

source: MISSION
th: ภารกิจ

source: Settings
th: การตั้งค่า

source: Language
th: ภาษา

# current_language
source: English
th: ภาษาไทย

source: English
th: ภาษาอังกฤษ

source: Thai
th: ภาษาไทย

source: Notification
th: การแจ้งเตือน

source: Logout
th: ล็อกเอาท์

source: Reset Settings
th: รีเซ็ตการตั้งค่า

source: BEFORE
th: ก่อนทาน

source: AFTER
th: หลังทาน

# scan_before_title
source: PERFECT!
th: สุดยอด!

# scan_before_content
source: Let's enjoy and don't forget to come back again after you finish eating.
th: ได้เวลาอร่อย! และอย่าลืมกลับมาอีกครั้งหลังทานเสร็จแล้ว

# back_to_home
source: Back to Home Screen
th: กลับไปยังหน้าจอหลัก

source: Scan your Food
th: สแกนอาหารของคุณ

source: Scan Result
th: ผลลัพธ์การสแกน

source: You have eaten
th: คุณได้กินไป

# sp_only
source: only
th: เพียงแค่

source: of the dish
th: ของทั้งจาน

source: Oh no!
th: ไม่นะ!

source: Wow!
th: ว้าว

# save_money_1
source: WOULD BE SAVED
th: คือเงินที่สามารถประหยัดได้

# save_money_2
source: If you have eaten all.
th: ถ้าคุณได้กินอาหารหมดจาน

# swipe_hint
source: Swipe Left or Right
th: ปัดไปทางซ้ายหรือขวา

source: Learn more
th: เรียนรู้เพิ่มเติม

# pollution_produced
source: Pollution produced is {pollution} grams of CO₂!
th: มลพิษที่เกิดขึ้นคือคาร์บอนไดออกไซต์ {pollution} กรัม!

# your_data
source: YOUR MEAL DATA
th: ข้อมูลมื้ออาหารของคุณ

# chart_desc
source: Following Pie Chart represents calories in each nutrition category of meal
th: แผนภูมิวงกลมด้านล่าง แสดงแคลอรี่ (cal) ของแต่ละหมู่ ในมื้ออาหารของคุณ

# take_home_recommendation
source: Take your leftover back home may be a good choice!
th: นำอาหารที่เหลืออยู่กลับบ้านก็อาจเป็นทางเลือกที่ดีนะ!

source: Any menu suits me?
th: มีเมนูที่เหมาะกับฉันไหม?

source: Recommended
th: แนะนำ

# food_cheaper
source: cheaper
th: ถูกกว่า

# food_less_carbon
source: less carbon footprint produced
th: คาร์บอนฟุตปริ้นท์น้อยกว่า

# points
source: pts
th: แต้ม

source: Promotion
th: โปรโมชั่น

source: Premium
th: พรีเมี่ยม

source: OOPS!
th: อ๊ะ!

# premium_only
source: This feature only available for premium users ;)
th: ฟีเจอร์นี้มีเฉพาะผู้ใช้พรีเมี่ยมเท่านั้น ;)

# what_is_premium
source: What's premium?
th: อะไรคือพรีเมี่ยม?

# window_close
source: Close
th: ปิด

source: Confirm
th: ยืนยัน

source: For You
th: สำหรับคุณ

source: Search
th: ค้นหา

# search_message
source: Enter some restaurant or menu
th: ลองใส่ร้านอาหารซักร้านหรือเมนู

# search_query_empty
source: Please enter what you want to search
th: โปรดใส่สิ่งที่คุณต้องการค้นหา

# no_data_found
source: Sorry, no data found
th: ขออภัย ไม่พบข้อมูลดังกล่าว

source: Exchange
th: แลก

# exchange_complete
source: Completed! Time to enjoy.
th: สำเร็จ! ได้เวลาอร่อย

# exchange_failed
source: Exchange Failed, Please verify you have enough points
th: การแลกล้มเหลว โปรดตรวจสอบว่าคุณมีแต้มเพียงพอ

# use_this_qr
source: Please show this QR Code to restaurant to redeem this
th: กรุณาแสดง QR Code นี้ให้กับร้านอาหารเพื่อแลกใช้งาน

source: {n} days pass
th: {n} วัน

source: Press to Exchange
th: กดเพื่อแลก

source: Points Shop
th: ร้านค้าแต้ม

source: Purchase Success
th: การซื้อสำเร็จ

# purchase_thanks
source: Thank you for your purchase! Enjoy!
th: ขอบคุณสำหรับการสั่งซื้อ! ขอให้สนุก!

# record_header_1
source: You've brought out
th: คุณได้ช่วยลดขยะอาหารไป

# record_header_2
source: food waste this month
th: ในเดือนนี้

# record_header_3
source: And produced methane
th: และผลิตมีเทนน้อยลง

# record_header_4
source: less than last month!
th: เทียบกับเดือนที่แล้ว!

# what_you_eaten
source: What've you eaten
th: สิ่งที่คุณได้กินไป

source: Health Status
th: สถานะสุขภาพ

source: Other Busters
th: บัสเตอร์คนอื่น

# thanks_buster_1
source: Looks like you've done a great job!
th: ดูเหมือนว่าคุณกำลังทำได้ดีเลย

# thanks_buster_2
source: Thanks, Our Food Buster!
th: ขอบคุณฟู้ดบัสเตอร์ของพวกเรา!

source: LEADERBOARD
th: ลีดเดอร์บอร์ด

source: Top Busters
th: ท็อปบัสเตอร์

source: Friends
th: เพื่อน

source: You produced
th: คุณได้ผลิต

# less_carbon
source: less carbon footprint than others
th: คาร์บอนฟุตปรินท์น้อยกว่าคนอื่น

# less_methane
source: less methane produced by using vehicle
th: เกิดมีเทนจากการใช้ยานพาหนะน้อยลง

# less_calories
source: less calories you consumed
th: บริโภคแคลเลอรี่น้อยลง

# more_carbon
source: more carbon footprint than others
th: คาร์บอนฟุตปรินท์มากกว่าคนอื่น

# more_methane
source: more methane produced by using vehicle
th: เกิดมีเทนจากการใช้ยานพาหนะมากขึ้น

# more_calories
source: more calories you consumed
th: บริโภคแคลเลอรี่มากขึ้น

# less_than_avg
source: less than average
th: น้อยกว่าค่าเฉลี่ย

source: Current Missions
th: ภารกิจที่กำลังทำอยู่

source: Craving missions?
th: กำลังมองหาภารกิจ?

# hard_missions_desc
source: Attempt hard missions to get more awesome prices!
th: ลองทำภารกิจที่ยากๆ เพื่อให้ได้ราคาที่คุ้มค่า!

source: Eat less...
th: กินสิ่งนี้ให้น้อยลง

source: Eat more...
th: กินสิ่งนี้ให้มากขึ้น

source: Within
th: ภายใน

source: days
th: วัน

source: I can do this!
th: ฉันทำได้!

# no_data_this_day
source: No Data found for this day
th: ไม่พบข้อมูลของวันนี้

source: Recorded Menu
th: เมนูที่บันทึกไว้

source: Breakfast
th: อาหารเช้า

source: Lunch
th: อาหารเที่ยง

source: Dinner
th: อาหารเย็น

# easy_guide
source: Easy Guide for you
th: แนวทางง่ายๆสำหรับคุณ

# guide_vegetable_header
source: Left over VEGETABLE = METHANE
th: ผักที่กินเหลือ = มีเทน!

# guide_vegetable_content
source: Don't like vegetables? If you don't like it, tell chef to not put in becaus 30% of your food waste are vegetables!
th: ไม่ชอบผักใช่ไหม? หากคุณไม่ชอบผัก ให้บอกเชฟว่าอย่าใส่ผักมา เพราะ 30% ของอาหารเหลือคือผัก!

# cannot_share_loading
source: You cannot share right now because it is loading or error occured
th: คุณไม่สามารถแชร์ได้ตอนนี้ เนื่องจากกำลังโหลดอยู่หรือมีข้อผิดพลาดเกินขึ้น

# detected_by_sfc
source: We automatically fill the menu for you from result of Smart Food Scanner 🌟✨ with confidence of
th: เราได้เติมเมนูของคุณโดยอัตโนมัติจากผลการสแกนของ Smart Food Scanner 🌟✨ ด้วยความมั่นใจที่

source: Fun Fact
th: เกร็ดน่ารู้

# feedback_title
source: Your Feedback Matters
th: ข้อเสนอแนะของคุณสำคัญ

# feedback_content
source: Do you want to do a survey about our prototype app? You can access survey at anytime using top-right actions in the home page.
th: คุณต้องการที่จะทำแบบสอบถามการใช้งานแอพโปรโตไทป์หรือไม่? คุณสามารถเข้าถึงแบบสอบถามได้ตลอด โดยการกดปุ่มตรงมุมขวาบนของหน้าโฮม

source: Not now
th: ยังไม่ใช่ตอนนี้

source: Don't ask again
th: อย่าถามอีก

# menu_co2
source: This menu created {0} grams of CO₂
th: อาหารเมนูนี้สร้างคาร์บอนไดออกไซต์ {0} กรัม
